Тест1/src/Reports/ПродажиСМашиныПоКатегориям/ПродажиСМашиныПоКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПродажиСМашиныПоКатегориям</name>
</mdclass:Report>

Тест1/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Catalogs/Категории/Категории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Категории</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Порядок1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kodpodkat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбщее</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСкания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДАФ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМАН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВольво</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автолайн</name>
    <type>
      <types>CatalogRef.CatAutoline</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДляОписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>допкат</name>
    <attributes>
      <name>ДопКатегория</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>допкат2</name>
    <attributes>
      <name>код</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Reports/ПродажиСМашиныПоКатегориям/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура МашинаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьАтрибуты();
КонецПроцедуры

&НаСервере
Процедура УстановитьАтрибуты()
	Реквизит1.Параметры.УстановитьЗначениеПараметра("машина",Машина.Ссылка);
	Реквизит1.Параметры.УстановитьЗначениеПараметра("категория",Категория.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьАтрибуты();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Машина = Справочники.Машины.НайтиПоКоду("000000001"); 
	Категория = Справочники.Категории.НайтиПоКоду("000000001");
	УстановитьАтрибуты();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.ПродажиСМашиныПоКатегориям.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция Категории()
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Категории.Ссылка,
	               |	Категории.ВерсияДанных,
	               |	Категории.ПометкаУдаления,
	               |	Категории.Предопределенный,
	               |	Категории.Родитель,
	               |	Категории.Код,
	               |	Категории.Наименование
	               |ИЗ
	               |	Справочник.Категории КАК Категории";
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции	

&НаСервере
Функция запчасти1(категория11)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаЗапчастейТаблица.Ссылка,
	               |	ПродажаЗапчастейТаблица.НомерСтроки,
	               |	ПродажаЗапчастейТаблица.Товар,
	               |	ПродажаЗапчастейТаблица.Количество,
	               |	ПродажаЗапчастейТаблица.Цена,
	               |	ПродажаЗапчастейТаблица.Скидка,
	               |	ПродажаЗапчастейТаблица.машина,
	               |	ПродажаЗапчастейТаблица.цена1,
	               |	ПродажаЗапчастейТаблица.Комментарий,
	               |	ПродажаЗапчастейТаблица.Сумма
	               |ИЗ
	               |	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
	               |ГДЕ
	               |	ПродажаЗапчастейТаблица.машина = &машина
	               |	И ПродажаЗапчастейТаблица.Товар.Категория = &категория";
	запрос.УстановитьПараметр("машина",Машина.Ссылка);
	запрос.УстановитьПараметр("категория",категория11);
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура РаспечататьРезультаты(Команда)
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();

КонецПроцедуры

&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("заголовок");
	ОбластьМакета.Параметры.машина=Машина;
	ТабДокумент.Вывести(ОбластьМакета);

	маш =  Макет.ПолучитьОбласть("табл");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	сум = Макет.ПолучитьОбласть("сумма");
	общ = Макет.ПолучитьОбласть("общ");
	НомерСтроки = 0;
	
	Итого = 0;
	Скидка = 0;
	категории1 = Категории();
	Для Каждого категория1 Из категории1 Цикл
        маш.Параметры.категория = категория1.Наименование;
		ТабДокумент.Вывести(маш);
		НомерСтроки = 0;
		итогоМаш = 0;
		скидкаМаш = 0;
		запчасти = запчасти1(категория1.ссылка);
		Для Каждого СтрокаТабличнойЧасти Из запчасти Цикл
				НомерСтроки = НомерСтроки + 1;
				ОбластьСтроки.Параметры.н = НомерСтроки;
				ОбластьСтроки.Параметры.код = СтрокаТабличнойЧасти.Товар.Код; 
				ОбластьСтроки.Параметры.артикул = СтрокаТабличнойЧасти.Товар.Артикул;
		//ОбластьСтроки.Параметры.нпроизв = СтрокаТабличнойЧасти.Товар.НомерПроизводителя;
				
				ОбластьСтроки.Параметры.наименование = СтрокаТабличнойЧасти.Товар.Наименование;
				Скидка1 = 0;
				Если(СтрДлина(СтрокаТабличнойЧасти.Комментарий)>2) Тогда
					ОбластьСтроки.Параметры.наименование = ОбластьСтроки.Параметры.наименование + ", " + СтрокаТабличнойЧасти.Комментарий;
				КонецЕсли;
				
				ОбластьСтроки.Параметры.цена = СтрокаТабличнойЧасти.Цена;
				ОбластьСтроки.Параметры.колво = СтрокаТабличнойЧасти.Количество;
				итогоМаш = итогоМаш + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
				Итого = Итого + СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;
				Если СтрокаТабличнойЧасти.Скидка <> Null И СтрокаТабличнойЧасти.Скидка > 0 Тогда
					Скидка = Скидка + СтрокаТабличнойЧасти.Скидка;
					скидкаМаш = скидкаМаш + СтрокаТабличнойЧасти.Скидка;
					Скидка1 = СтрокаТабличнойЧасти.Скидка;
				КонецЕсли;
				ОбластьСтроки.Параметры.сумма = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество - Скидка1;
				//ОбластьСтроки.Параметры.скидка = Скидка1; 
				
				ТабДокумент.Вывести(ОбластьСтроки);
		КонецЦикла;
		сум.Параметры.сумма = итогоМаш - скидкаМаш;
		ТабДокумент.Вывести(сум);
	КонецЦикла;

	общ.Параметры.сумма = Итого - Скидка;
	ТабДокумент.Вывести(общ);

	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()
